{
	"istp": "You are Introverted Sensing Thinking Perceiving (ISTP) who are fundamentally Performers (note the capital 'P' :-)), but as Ts their areas of interest tend to be mechanical rather than artistic like those of ISFPs, and unlike most ESPs they do not present an impression of constant activity. On the contrary, they lie dormant, saving their energy until a project or an adventure worthy of their time comes along--and then they launch themselves at it. ",
	"istj": "You are Introverted Sensing Thinking Judging (ISTJ) who are often called inspectors. They have a keen sense of right and wrong, especially in their area of interest and/or responsibility. They are noted for devotion to duty. Punctuality is a watchword of the ISTJ. The secretary, clerk, or business(wo)man by whom others set their clocks is likely to be an ISTJ.",
	"intp": "You are Introverted iNtuitive Thinking Perceiving (INTP) who are pensive, analytical folks. They may venture so deeply into thought as to seem detached, and often actually are oblivious to the world around them.",
	"intj": "You are Introverted iNtuitive Thinking Judging (INTJ) and to outsiders, INTJs may appear to project an aura of \"definiteness\", of self-confidence. This self-confidence, sometimes mistaken for simple arrogance by the less decisive, is actually of a very specific rather than a general nature; its source lies in the specialized knowledge systems that most INTJs start building at an early age. When it comes to their own areas of expertise -- and INTJs can have several -- they will be able to tell you almost immediately whether or not they can help you, and if so, how.",
	"entj": "You are Extraverted iNtuitive Thinking Judging (ENTJ) who have a natural tendency to marshall and direct. This may be expressed with the charm and finesse of a world leader or with the insensitivity of a cult leader. The ENTJ requires little encouragement to make a plan.",
	"entp": "You are Extraverted iNtuitive Thinking Perceiving (ENTP) and \"Clever\" is the word that perhaps describes ENTPs best. The professor who juggles half a dozen ideas for research papers and grant proposals in his mind while giving a highly entertaining lecture on an abstruse subject is a classic example of the type. So is the stand-up comedian whose lampoons are both funny and incisively accurate.",
	"estj": "You are Extraverted Sensing Thinking Judging (ESTJ) who thrive on order and continuity. Being extraverted, their focus involves organization of people, which translates into supervision. While ENTJs enjoy organizing and mobilizing people according to their own theories and tactically based agendas, ESTJs are content to enforce \"the rules,\" often dictated by tradition or handed down from a higher authority.",
	"estp": "You are Extraverted Sensing Thinking Judging (ESTP) who are spontaneous, active folks. Like the other SPs, ESTPs get great satisfaction from acting on their impulses. Activities involving great power, speed, thrill and risk are attractive to the ESTP. Chronic stifling of these impulses makes the ESTP feel \"dead inside\".",
	"esfj": "You are Extraverted Sensing Feeling Judging (ESFJ) who are guardians of birthdays, holidays and celebrations, ESFJs are generous entertainers. They enjoy and joyfully observe traditions and are liberal in giving, especially where custom prescribes.",
	"isfj": "You are Introverted Sensing Feeling Judging (ISFJ) who are characterized above all by their desire to serve others, their \"need to be needed.\" In extreme cases, this need is so strong that standard give-and-take relationships are deeply unsatisfying to them; however, most ISFJs find more than enough with which to occupy themselves within the framework of a normal life. ",
	"enfj": "You are Extraverted iNtuitive Feeling Judging (ENFJ) who are the benevolent 'pedagogues' of humanity. They have tremendous charisma by which many are drawn into their nurturant tutelage and/or grand schemes. Many ENFJs have tremendous power to manipulate others with their phenomenal interpersonal skills and unique salesmanship. But it's usually not meant as manipulation -- ENFJs generally believe in their dreams, and see themselves as helpers and enablers, which they usually are.",
	"infj": "You are Introverted iNtuitive Feeling Judging (INFJ) who are distinguished by both their complexity of character and the unusual range and depth of their talents. Strongly humanitarian in outlook, INFJs tend to be idealists, and because of their J preference for closure and completion, they are generally \"doers\" as well as dreamers. ",
	"esfp": "\"Where's the party?\" You are Extraverted Sensing Feeling Perceiving (ESFP) who love people, excitement, telling stories and having fun. The spontaneous, impulsive nature of this type is almost always entertaining. And ESFPs love to entertain -- on stage, at work, and/or at home. Social gatherings are an energy boost to these \"people\" people.",
	"isfp": "You are Introverted Sensing Feeling Perceiving (ISFP) who are the first to hear the different drummer. Many eagerly plunge into new fashions, avant garde experiences, 'hip' trends--some even setting the trends.",
	"enfp": "You are Extraverted iNtuitive Feeling Perceiving (ENFP) who are both \"idea\"-people and \"people\"-people, who see everyone and everything as part of a cosmic whole. They want to both help and to be liked and admired by other people, on both an individual and a humanitarian level. This is rarely a problem for the ENFP, as they are outgoing and warm, and genuinely like people. ",
	"infp": "You are Introverted iNtuitive Feeling Perceiving (INFP) who never seem to lose their sense of wonder. One might say they see life through rose-colored glasses. It's as though they live at the edge of a looking-glass world where mundane objects come to life, where flora and fauna take on near-human qualities."
	
}